app/views/scores/index.html.erb

					<tr>
						<td><%= User.find(score.id_user).nick %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]