app/views/users/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
								<tr>
									<td><%= User.find(score.id_user).nick %></td>