app/controllers/elements_controller.rb

	def index
		@elements = Element.all
---
SELECT "elements".* FROM "elements"

	def property
		@elements = Element.all
---
SELECT "elements".* FROM "elements"

	def element_valencies
		@valencies = Element.order_valencies_in_a_string
---
SELECT "elements".* FROM "elements"

	def game
		@elements = Element.all
---
SELECT "elements".* FROM "elements"