app/controllers/scores_controller.rb

	def index
		@scores = Score.all
		@scores_timer_easy = Score.where(mode: 'Timer mode').where(levelgame: 'easy');
---
SELECT "scores".* FROM "scores" WHERE "scores"."mode" = ? AND "scores"."levelgame" = ?  ORDER BY puntuation DESC, mins, secs  [["mode", "Timer mode"], ["levelgame", "easy"]]

	def create
    success = false
    puntuation = params[:puntuation]
    time = params[:time]
    mode = params[:mode]
    levelgame = params[:levelgame]
    id_user = current_user.id

    new_score = Score.new id_user: id_user, puntuation: puntuation, time: time, mode: mode, levelgame: levelgame

    if new_score.save
---
INSERT INTO "scores" ("id_user", "puntuation", "mins", "secs", "mode", "levelgame", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)