app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "scores".* FROM "scores" WHERE "scores"."mode" = ? AND "scores"."id_user" = ?  [["mode", "Timer mode"], ["id_user", 1]]
SELECT "scores".* FROM "scores" WHERE "scores"."mode" = ? AND "scores"."levelgame" = ? AND "scores"."id_user" = ?  ORDER BY puntuation DESC, mins, secs  [["mode", "Timer mode"], ["levelgame", "easy"], ["id_user", 1]]
SELECT "scores".* FROM "scores" WHERE "scores"."mode" = ? AND "scores"."levelgame" = ? AND "scores"."id_user" = ?  [["mode", "Timer mode"], ["levelgame", "easy"], ["id_user", 1]]
---
  def show
		@user = User.find params[:id]
    @score_timer = Score.where(mode: 'Timer mode').where(id_user: @user.id);
    @score_timer_easy = Score.where(mode: 'Timer mode').where(levelgame: 'easy').where(id_user: @user.id).order('puntuation DESC, mins, secs');
    @score_timer_medium = Score.where(mode: 'Timer mode').where(levelgame: 'medium').where(id_user: @user.id).order('puntuation DESC, mins, secs');
    @score_timer_hard = Score.where(mode: 'Timer mode').where(levelgame: 'hard').where(id_user: @user.id).order('puntuation DESC, mins, secs');
    @score_timer_expert = Score.where(mode: 'Timer mode').where(levelgame: 'expert').where(id_user: @user.id).order('puntuation DESC, mins, secs');
    @score_normal = Score.where(mode: 'Normal mode').where(id_user: @user.id);